{"films":[{"name":"Star Wars: Episode III - Revenge of the Sith","author":"Hayden Christensen, Natalie Portman, Ewan McGregor","price":"7.5","description":"Revenge of the Sith is my favorite movie (not only considering the six movies of the saga, but it's one of my favorite films ever). I love the prequels and I like the original trilogy. Star Wars prequel trilogy has a terrific scenery, lots of spectacular scenes and fabulous elaborate costumes.\n\nThe world of Star Wars is like a dreamworld for me. If I could live in it, I would.\n\nThe whole Star Wars saga tells the story about family and love. The greatest story of all, the timeless story about Anakin Skywalker is so close to my heart, that's why I love Star Wars so much. The tagline of the film - \"The saga is complete\". So there is no need for awful Disney sequels.\n\n⭐⭐⭐Screenplay: 95/100\n\n⭐ Acting Performance: 89/100\n\n⭐ Film Editing: 87/100\n\n⭐ Cinematography: 86/100\n\n⭐⭐ Visual Effects: 91/100\n\n⭐⭐⭐Sound Effects: 96/100\n\n⭐⭐ Art Direction & Set Decoration: 92/100\n\n⭐⭐ Original Scores: 93/100\n\n⭐⭐ Makeup: 94/100\n\n⭐⭐⭐Costume Design: 98/100","img":"https://m.media-amazon.com/images/M/MV5BNTc4MTc3NTQ5OF5BMl5BanBnXkFtZTcwOTg0NjI4NA@@._V1_UY268_CR9,0,182,268_AL_.jpg","id":"e938f350-b402-11eb-b090-dd96d9ba8160"},{"name":"Conjuring 2","author":" Vera Farmiga, Patrick Wilson, Madison Wolfe","price":"7.3","description":"The Conjuring 2 doesn't waste time in bringing the scares in. By that, I mean you're pretty much in the thick of it from the get-go, being given some background (via another very notorious haunting incident) for what is to follow.\n\nThe Warrens are sent on behalf of the church to investigate some paranormal activity which is whipping up a media storm in Enfield, England and, as per the first movie, they go and attempt to work their magic on the situation. Once again, a family is being haunted and they fear for their sanity and lives. There are a few new twists this time round, so all does not play out as before - but it's not a complete departure from the format, which might have made it a bit more gripping in places.\n\nJames Wan's trademark visual style is repeated in this movie - his bag of tricks sometimes yielding a sense of deja vu but generally working like a charm. When it's intended to scare, it really does. The scares come a bit more frequently than in the first movie and do manage to build a lot of tension, even if you've seen the original, so well done to Wan for that.\n\nWhat's really enjoyable about this movie, is its nostalgic recreation of 70s England. Wan has really done a great job of this, which is surprising given that he's not from there. Also, the central support role of Janet Hodgson is pretty crucial to empathising with the Enfield family and Madison Wolfe gives a solid performance.\n\nIt's arguable this one is as strong as the first. I really enjoyed it and would recommend it to anyone who enjoyed part one, or indeed likes movies of a haunting or possession theme.\n\nSome awesome, unsettling and creepy music in places too.","img":"https://m.media-amazon.com/images/M/MV5BZjU5OWVlN2EtODNlYy00MjhhLWI0MDUtMTA3MmQ5MGMwYTZmXkEyXkFqcGdeQXVyNjE5MTM4MzY@._V1_UX182_CR0,0,182,268_AL_.jpg","id":"2b84da30-b412-11eb-abb1-63a779096ae5"},{"name":"Taken","author":"Liam Neeson, Maggie Grace, Famke Janssen","price":"7.8","description":"When the protagonist can electro-shock torture a thug for information, and the audience can applaud him for it, it's evident that an intriguing character has been born.","img":"https://m.media-amazon.com/images/M/MV5BMTM4NzQ0OTYyOF5BMl5BanBnXkFtZTcwMDkyNjQyMg@@._V1_UX182_CR0,0,182,268_AL_.jpg","id":"a6539940-b4bc-11eb-919a-938aa1384cfe"},{"name":"Venom","author":"Tom Hardy, Michelle Williams, Riz Ahmed","price":"6.7","description":"Venom is about the symbiotic relationship of man and alien, with the latter being the gross one. Funny at times, with a lovely performance from Tom Hardy -if you are a fan of mr Hardy, this is going to be entertaining for you. First half goes very well in terms of setting the story and the venom universe, second part is more about action and there it has a few flaws but it is still fun and interesting to watch. It is a cool view on the \"almost anti-hero\" venom/eddie character that kept my attention. I had a good time watching this in the theaters and i ll definitely have a second view when it comes out in bray or dvd. So, all in all its def not the best action film of all times or even of 2018...but dont have too high expectations and you will definitely like it.","img":"https://m.media-amazon.com/images/M/MV5BNzAwNzUzNjY4MV5BMl5BanBnXkFtZTgwMTQ5MzM0NjM@._V1_UX182_CR0,0,182,268_AL_.jpg","id":"5a2b7af0-b567-11eb-a9cc-09574a1b2d88"},{"name":"Inception","price":"8.8","description":"What is the most resilient parasite? An Idea! Yes, Nolan has created something with his unbelievably, incredibly and god- gifted mind which will blow the minds of the audience away. The world premiere of the movie, directed by Hollywood's most inventive dreamers, was shown in London and has already got top notch reviews worldwide and has scored maximum points! Now the question arises what the movie has that it deserve all this?\n\nDom Cobb(Di Caprio) is an extractor who is paid to invade the dreams of various business tycoons and steal their top secret ideas. Cobb robs forcefully the psyche with practiced skill, though he's increasingly haunted by the memory of his late wife, Mal (Marion Cotillard), who has a nasty habit of showing up in his subconscious and wreaking havoc on his missions. Cobb had been involved so much in his heist work that he had lost his love!\n\nBut then, as fate had decided, a wealthy business man Saito( Ken Watanabe) hands over the responsibility of dissolving the empire of his business rival Robert Fischer Jr.(Cillian Murphy). But this time his job was not to steal the idea but to plant a new one: 'Inception'\n\nThen what happens is the classic heist movie tradition. To carry out the the task, Cobb's 'brainiac' specialists team up again with him, Arthur (Joseph Gordon-Levitt), his longtime organizer; Tom Hardy (Eames), a \"forger\" who can shapeshift at will; and Yusuf (Dileep Rao), a powerful sedative supplier.\n\nThere is only one word to describe the cinematography, the set designs and the special effects, and that is Exceptional! You don't just watch the scenes happening, you feel them. The movie is a real thrill ride. The action scenes are well picturised and the music by Hans Zimmer is electronically haunting. Never, in the runtime of the movie, you will get a chance to move your eyes from the screen to any other object.\n\nLeonardo, who is still popularly known for Jack Dawson played by him in Titanic, should be relieved as his role as Dom Cobb will be remembered forever. His performance may or may not fetch him an Oscar but it will be his finest performance till date. The supporting cast too did an extraordinary work. Christopher Nolan, ah! what a man he is. His work is nothing less than a masterpiece and he deserves all the awards in the 'Best Director' category. If \"Inception\" is a metaphysical puzzle, it's also a metaphorical one: It's hard not to draw connections between Cobb's dream-weaving and Nolan's film making, intended to seduce us, mess with our heads and leave an ever-lasting impression.\n\nTo conclude, I would just say before your life ends, do yourself a favor by experiencing this exceptionally lucid classic created by Nolan!\n\nMy Rating: 10/10\n\nThanks & Regards","img":"https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_UX182_CR0,0,182,268_AL_.jpg","author":"Leonardo DiCaprio, Joseph Gordon-Levitt, Elliot Page","id":"95dd9d80-b567-11eb-a9cc-09574a1b2d88"},{"name":"Ted","price":"6.9","description":"I really should start this with a warning: This film is not for everyone! If you are easily offended (by swearing, sexual references, casual racism and various stereotypes) then you should read no further and give this one a miss. However, if you are a fan of Seth MacFarlane's other projects (Family Guy, American Dad) and maybe you call yourself an \"80's child\" (so many pop culture references to this time) you are going to love this.\n\nSure some parts are a little disjointed, the story seems vaguely familiar and the \"moral\" of it kind of gets lost but quite frankly, it's just so darn funny none of that matters. The script is hilarious, the cameos are fantastic and the soundtrack is perfect.\n\nTed himself is well animated and Seth (apart from sounding a little like Peter Griffin) voices him with the usual competence. Mark Wahlberg delivers exactly what we have come to expect from him, and the rest of the cast seem to have had fun filming, which comes across in the various performances no matter how big or small. The acceptance and interaction of everyone with a living teddy-bear adds to the simple joy of this film, and you find yourself happy to watch and not question why nobody is fazed by this. TED is a laugh a minute, party of a film and I, for one, can't wait to see it again.","img":"https://m.media-amazon.com/images/M/MV5BMTQ1OTU0ODcxMV5BMl5BanBnXkFtZTcwOTMxNTUwOA@@._V1_UX182_CR0,0,182,268_AL_.jpg","author":"Mark Wahlberg, Mila Kunis, Seth MacFarlane","id":"01ea7160-b568-11eb-a9cc-09574a1b2d88"},{"name":"Top Gun","price":"6.9","description":"Top Gun is a high quality, visually stunning film that does all it can to take your breath away. It is the excellently choreographed dog fights that remain in the mind longer than anything as they are high octane, dazzling bursts of excitement which bring the film to life. However, fighter jet sequences do not make a film and it is the plot where Top Gun has some occasional problems.\n\nParts of the story are overly cheesy and clichéd. The proud to be American theme is dire, repetitive and anyone who dislikes over patriotism in films will despise this. The story line involving Tom Cruise and Tom Skerrit approaches boredom and is the pinnacle of Top Gun's cheese. 'Cheese' is OK, as long as it is not serious and that is where that specific story line falls flat. The fun cheesy parts are some of the films best moments. The volleyball scene is truly a classic and the four actors involved are genuinely enjoying themselves. The relationship between Tom Cruise and Anthony Edwards is also very moving at times and the dynamic they have makes for great viewing.\n\nThe acting is what saves Top Gun from being Tinsel town garbage. Tom Cruise launched his career with this film. His cocky smile makes him perfect for this role and Cruise does fantastically at portraying a determined, passionate character. It is the emotional scenes where Cruise really sets himself apart from his peers. Cruise provides the few scenes where the audience are made to feel any emotion and he carries out his responsibility creditably. Anthony Edwards as Goose is also effective as the man who takes second spot to Cruise's Maverick. He is instantly popular with the audience with his wit, humour and charm. Val Kilmer and Rick Rossovich are great as the rivals. They play off each other really well and do a fantastic job to personify arrogance. Michael Ironside does what he does best and once again, manages to go through a whole film without smiling.\n\nThe story between Cruise and Kelly McGillis is very romantic and sensual. The heat between them is conveyed very well on screen and it is this that sets Top Gun above films such as Iron Eagle and Chuck Norris films.\n\nBerlin's 'Take My Breath Away' is a song that still gets a good deal of airplay and suits this film to perfection; it's cheesy and its 80s. The music is very effective at setting the mood and complements the feel of the film.\n\nTop Gun is a film that achieves its objectives, to entertain. If you're looking for intelligent writing or mass thought provocation, this film isn't for you. Top Gun is best suited to those who desire to switch off their brain and enjoy.","img":"https://m.media-amazon.com/images/M/MV5BZjQxYTA3ODItNzgxMy00N2Y2LWJlZGMtMTRlM2JkZjI1ZDhhXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_UX182_CR0,0,182,268_AL_.jpg","author":"Tom Cruise, Tim Robbins, Kelly McGillis","id":"310cf0d0-b568-11eb-a9cc-09574a1b2d88"},{"name":"Now You See Me 2","price":"6.5","description":"It's just like the first movie...it takes you into the mind of magic tricks and just how easy, hard and confusing and well timed it can be. It's interesting to see just how they do it, because we keep forgetting it's all fake and not real. This movie is magic mixed with a robbery heist all combined into one.\n\nAll the actors return, excluding Isla Fisher. This time we have a lady by the name of Lula (Played by Lizzy Caplan) who, to an extent replaces Isla Fisher. She's actually really funny and charming, to say the least. All the characters are exactly as the same as they were in the first one. We have a new villain by the name of Walter Mabry (played by Daniel Radcliffe.) He wants the Horsemen to capture a certain device so he can have access to everyone's details. Daniel Radcliffe surprisingly makes a good villain.\n\nWe rate this 3/5 stars (7/10.) The movie is entertaining, action packed and nonstop guessing and thrills all the way through. Why didn't we rate it higher? We thought it didn't deserve any higher. It's an enjoyable flick, just like the first one. Nothing more, nothing less. Go and check it out. It's worth seeing.","img":"https://m.media-amazon.com/images/M/MV5BYjhlNDljNTgtZjc4My00NmZmLTk2YzAtYWE5MDYwYjM4MTkzXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_UX182_CR0,0,182,268_AL_.jpg","author":"Jesse Eisenberg, Mark Ruffalo, Woody Harrelson","id":"801a0ff0-b568-11eb-a9cc-09574a1b2d88"},{"name":"Doctor Strange","price":"7.5","description":"Perfectly enjoyable fun. Sound familiar? Doctor Strange being a different kind of hero doesn't really excuse most of this film's conventional plotting.\n\nThere's a much more interesting film in here, one in which Mads Mikkelsen isn't the main villain (yet) and getting in the way of the hero's journey and in which Tilda Swinton is even more ambiguous. Her obvious parallels to Stephen are perfectly apt and yet not allowed enough time to breathe and spin. It's all a last minute reveal and then a call to arms because plot and all is well because plot.\n\nA lot has been made of the \"trippy\" special effects, and I guess they are compared to the traditional visuals employed in these types of movies. But let's not get carried away. Besides the travels through space and mind it's mostly buildings moving around like they're in Inception.\n\nI didn't buy the last end credits scene. Useless and not earned. I'm sick of hero's with photographic memories. Let the hero be exceptional on their own merits. Action scenes could be less choppily edited. But still, it's fun in ways other recent Marvel movies haven't been.","img":"https://m.media-amazon.com/images/M/MV5BNjgwNzAzNjk1Nl5BMl5BanBnXkFtZTgwMzQ2NjI1OTE@._V1_UX182_CR0,0,182,268_AL_.jpg","author":"Benedict Cumberbatch, Chiwetel Ejiofor, Rachel McAdams","id":"e8972600-b56b-11eb-a9cc-09574a1b2d88"}]}